""" Тема 3 - Переменные"""

# Переменные в Python - это ссылки на объекты
a = "car"
my_car = a  # my_car и a ссылаются на один и тот же объект
# Название переменной должно начинаться с буквы, может содержать буквы, цифры, нижний прочерк
# Python автомтиески удаляет объекты на которые нет ссылок
# название переменной должно начинаться  маленькой буквы
# Название переменной семантически должно указывать на вид объекта
# Переменная в Python должна иметь какое либо значение
x = y = z = 0  # множественное присвоение
x1, y1 = 1, 2  # множественное присовение

"""В Python по PEP - 8 для имен переменных используется Snake Case, имя состоит из строк
разделенных нижним прочерком, каждое слово пишут с маленькой буквы.
    Пример: my_car, my_second_car                                          """
