"""Тема 14. Работа с Python из командной строки"""
# Для открытия командной строки в Windows необходимо нажать комбинацию клавиш windows + r
# и ввести в открывшемся меню команды cmd, далее нажать enter

# Для открытия в командной строке интерпретатора Python, необходимо ввести команду python
# Для выхода из интерпретатора необходимо нажать сочетание клавиш ctrl + z

# Чтобы запустить Python -  файл, необходимо перейти в директорию где он находится
# Для этого в командной строке  необходимо ввести cd + адрес директории
# Пример: cd C:\Users\andrey\Documents\
# Далее в этой директории необходимо ввести название файла с расширением py

