"""Тема 11. Как Python выполняет программы"""
"""Python также включает в себя интерпретатор. Интерпретатор - читает программу, и выполняет содержащиеся в ней 
(код)"""
"""Код который мы пишем на Python выполняется интерпретатором"""
"""Программа на Python представляет собой текстовый файл, содержащий операторы Python"""
"""Выполнение программы на Python, означает последовательое выполнение всех команд в файле друг за другом"""
"""
Выполнение программы с точки зрения Python
1) Происходит компиляция в байт - код. 
Байт - код - это низкоуровневая форма программы, получаемая в результате ее компиляции Python.  
Байт - код сохраняется в подкаталоге __pycashe__ (начиная с версии 3.2)
2) Выполнение на виртуальной машине Python(Интерпретаторе)
"""
# Интерпретатор - это программа, которая выполняет написанный код на Python
# В Windows значики файлов исходного кода имеют белый фон, значки байт-кода черный фон

# В Python v3.2 и позднее файлы байт-кода сохраняются в подкаталоге __pycache__